# YOLOv11n + MLCA + PANet 特征融合
# 针对 NEU-DET 钢材缺陷检测优化

nc: 6
scales:
  n: [0.50, 0.25, 1024]

# ============ Backbone (含 MLCA) ============
backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0
  - [-1, 1, Conv, [128, 3, 2]]         # 1
  - [-1, 2, C3k2, [128, True, 0.25]]   # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3-P3/8
  - [-1, 4, C3k2, [256, True, 0.25]]   # 4
  - [-1, 1, MLCA, [256]]               # 5 🔴 MLCA 注意力
  - [-1, 1, Conv, [512, 3, 2]]         # 6-P4/16
  - [-1, 4, C3k2, [512, True, 0.25]]   # 7
  - [-1, 1, MLCA, [512]]               # 8 🔴 MLCA 注意力
  - [-1, 1, Conv, [1024, 3, 2]]        # 9-P5/32
  - [-1, 2, C3k2, [1024, True, 0.25]]  # 10
  - [-1, 1, SPPF, [1024, 5]]           # 11

# ============ PANet 特征融合 ============
head:
  # ----- 自顶向下路径 (Top-down) -----
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 12
  - [[-1, 6], 1, Concat, [1]]                   # 13
  - [-1, 2, C3k2, [512, False, 0.25]]           # 14

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 15
  - [[-1, 4], 1, Concat, [1]]                   # 16
  - [-1, 2, C3k2, [256, False, 0.25]]           # 17

  # P3 层增加 MLCA 注意力
  - [17, 1, MLCA, [256]]                        # 18 🔴 MLCA 注意力

  # ----- 自底向上路径 (Bottom-up) -----
  - [-1, 1, Conv, [256, 3, 2]]                  # 19
  - [[-1, 14], 1, Concat, [1]]                  # 20
  - [-1, 2, C3k2, [512, False, 0.25]]           # 21

  - [-1, 1, Conv, [512, 3, 2]]                  # 22
  - [[-1, 11], 1, Concat, [1]]                  # 23
  - [-1, 2, C3k2, [1024, True, 0.25]]           # 24

  # P5 层增加 MLCA 注意力
  - [24, 1, MLCA, [1024]]                       # 25 🔴 MLCA 注意力

  # ----- 检测头 -----
  - [[18, 21, 25], 1, Detect, [nc]]             # 26